GlomarGadaffi/tdeck-max-phone/sdkconfig.defaults
# Target configuration
CONFIG_IDF_TARGET="esp32s3"

# Flash settings (16MB Flash)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# PSRAM settings (8MB Octal PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SIZE_8MB=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# CPU Clock Frequency
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

# FreeRTOS Core pinning & clock tick
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_NUMBER_OF_CORES=2

# LWIP Socket & Networking
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_RCVTIMEO=y
CONFIG_LWIP_IP4_REASSEMBLY=y
CONFIG_LWIP_IP4_FRAG=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# Compiler Optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# C++ exceptions -- the vendored pocket-dial SIP parser (components/sip_core,
# ported from tincan) uses them.
CONFIG_COMPILER_CXX_EXCEPTIONS=y
